Repository: 0xeeeeeeeeeeee/AudioCopy
Catalog: AudioCopyUI_ReceiverOnly/Strings/*/Setting.resw
Source language: en_gb
Languages: de, es, ko, ru

# AudioQuality_Option3_Bits.PlaceholderText
source: bit
ko: 위치
ru: бит

# AudioQuality_Option3_Channels.PlaceholderText
source: Channel
de: Kanal
es: Canal
ko: 채널
ru: канал

# AudioQuality_Option1.Text
source: No resampling (use system-configured audio quality)
de: Keine Neuabtastung (verwendet die vom System eingestellte Audioqualität)
es: No volver a muestrear (usar la calidad de audio configurada en el sistema)
ko: 리샘플링 안 함(시스템 설정 음질 사용)
ru: не передискретизировать (использовать качество звука, заданное в системе)

# AudioQuality_Option1_Desc.Text
source: For audio capture with bit depths exceeding 16bit, please use the preset or custom sample rate options
de: Wenn Sie Audio mit einer Bittiefe von mehr als 16 Bit aufnehmen möchten, verwenden Sie die Option für voreingestellte oder benutzerdefinierte Abtastraten.
es: Si necesita capturar audio con una profundidad de bits superior a 16 bits, utilice las opciones de frecuencia de muestreo preestablecidas o personalizadas.
ko: 16비트 이상의 오디오 비트 심도를 캡처하려면 사전 설정 또는 사용자 정의 샘플링 옵션을 사용하세요
ru: Если необходимо записать аудио с разрядностью более 16 бит, используйте опции предустановленной или пользовательской частоты дискретизации.

# AudioQuality_Option2.Text
source: Use preset resampling configuration
de: Vorgefertigte Resampling-Konfiguration verwenden
es: Usar configuración de remuestreo preestablecida
ko: 사전 설정된 리샘플링 구성을 사용
ru: использовать предустановленную конфигурацию ресемплинга

# AudioQuality_Option3.Text
source: Custom Resampling Configuration
de: Benutzerdefinierte Resampling-Konfiguration
es: Configuración personalizada de remuestreo
ko: 사용자 정의 리샘플링 구성
ru: Пользовательская конфигурация ресемплинга

# AudioQuality_RawBufferSize.Text
source: RAW audio buffer size
de: RAW-Audiopuffergröße
es: Tamaño del búfer de audio RAW
ko: RAW 오디오 버퍼 크기
ru: Размер буфера RAW-аудио

# AudioQuality_Option3_Samplerate.PlaceholderText
source: Sample rate
de: Abtastrate
es: Tasa de muestreo
ko: 샘플링 레이트
ru: частота дискретизации

# AudioQuality_Foramt
source: {0} channel, {1} bit, {2} Hz
de: {0} Kanäle, {1} Bit, {2} Hz
es: {0} canales, {1} bits, {2} Hz
ko: {0} 채널, {1} 비트, {2} Hz
ru: {0} каналов, {1} бит, {2} Гц

# AudioQuality_Current
source: Current audio quality:
de: Aktuelle Tonqualität:
es: Calidad de sonido actual:
ko: 현재 음질:
ru: Текущее качество звука:

# AudioQuality_CurrentUnavailable
source: Sound quality unavailable, please check backend
de: Tonqualität nicht verfügbar, bitte Backend prüfen
es: Calidad de audio no disponible, verifique el backend
ko: 음질을 사용할 수 없습니다. 백엔드를 확인하세요.
ru: Качество звука недоступно, проверьте серверную часть

# BackendSetting_Title.Text
source: Backend settings
de: Backend-Einstellungen
es: Configuración del backend
ko: 백엔드 설정
ru: Настройки серверной части

# BackendSetting_AddressBindBox.PlaceholderText
source: IP address to bind (leave blank for any address)
de: Zu bindende IP-Adresse (leer lassen für beliebige Adresse)
es: Dirección IP a vincular (dejar vacío para cualquier dirección)
ko: 바인딩할 IP 주소(비워두면 모든 주소 허용)
ru: IP-адрес для привязки (оставьте пустым для любого адреса)

# BackendSetting_PortBindBox.PlaceholderText
source: Port number to bind (leave blank for default)
de: Zu bindende Portnummer (leer lassen für Standard)
es: Número de puerto a vincular (dejar vacío para el predeterminado)
ko: 바인딩할 포트 번호(비워두면 기본값)
ru: Номер порта для привязки (оставьте пустым для значения по умолчанию)

# BackendSetting_allowNonLocalPair.Content
source: Allow pairing with non-LAN addresses (including loopback)
de: Erlaube die Kopplung mit Adressen außerhalb des lokalen Netzwerks (einschließlich Loopback-Adressen)
es: Permitir emparejamiento con direcciones que no son de LAN (incluye direcciones de bucle)
ko: 비-로컬 네트워크 주소(루프백 주소 포함)와 페어링 허용
ru: Разрешить сопряжение с адресами вне локальной сети (включая loopback-адреса)

# BackendSetting_useDevelopmentMode.Content
source: Configure the backend as a development environment (for development only, do not use in production)
de: Backend für Entwicklungsumgebung konfigurieren (Nur für Entwicklung, nicht in Produktionsumgebung verwenden)
es: Configurar el backend como entorno de desarrollo (solo para desarrollo, no usar en producción)
ko: 개발 환경으로 백엔드 구성 (개발 전용, 프로덕션 환경에서 사용하지 마세요)
ru: Настроить серверную часть для среды разработки (только для разработки, не использовать в рабочей среде)

# BackendSetting_customEnvironmentVars.PlaceholderText
source: Custom backend environment variables (Use with caution, may pose unknown risks) Example: key1=value1,key2=value2,...
de: Umgebungsvariablen für benutzerdefinierte Backends (Vorsicht, kann unbekannte Risiken verursachen) Beispiel: key1=value1,key2=value2,...
es: Variables de entorno personalizadas del backend (usar con precaución, puede generar riesgos desconocidos) Ejemplo: key1=value1,key2=value2,...
ko: 사용자 정의 백엔드 환경 변수 (주의: 알 수 없는 위험을 초래할 수 있음) 예시: key1=value1,key2=value2,...
ru: Пользовательские переменные окружения для бэкенда (используйте с осторожностью, могут привести к непредвиденным рискам) Пример: key1=value1,key2=value2,...

# BackendSetting_BackendVersion
source: Backend version:
es: Versión del backend:
ko: 백엔드 버전:
ru: Версия серверной части:

# BackendSetting_RebootBackendButton.Content
source: Restart backend
de: Backend neu starten
es: Reiniciar el backend
ko: 백엔드 재시작
ru: Перезапустить серверную часть

# BackendSetting_UpgradeBackendButton.Content
source: Update backend
de: Backend aktualisieren
es: Actualizar backend
ko: 백엔드 업데이트
ru: Обновление серверной части

# BackendSetting_disableCustomSettings.Content
source: Disable custom configuration
de: Benutzerdefinierte Konfiguration deaktivieren
es: Deshabilitar configuración personalizada
ko: 사용자 정의 구성 비활성화
ru: Отключить пользовательскую конфигурацию

# AboutPage_Title.Text
source: About
de: Über
es: Acerca de
ko: 정보
ru: О

# AboutString
source: AudioCopy {0} Copyright 0xeeeeeeeeeeee (0x12e) 2025.[line]Future versions will be built upon the AudioClone component.[line]Portions of this project's code are derived from "Stream What Your Hear" (https://github.com/StreamWhatYouHear/SWYH), and the concept is also inspired by it.[line]This project is licensed under GNU GPLv2 - see the license for details (https://github.com/0xeeeeeeeeeeee/AudioCopy/blob/master/LICENSE)[line][line][line][line][line][line][line][line]Debug information:[line]Data directory: {1}[line][line]Settings:[line]{2}[line][line]Latest log path:[line]{3}
de: AudioCopy {0} Copyright 0xeeeeeeeeeeee (0x12e) 2025.[line]Zukünftig basierend auf der AudioClone-Komponente aufgebaut.[line]Teile des Projektcodes stammen von "Stream What Your Hear" (https://github.com/StreamWhatYouHear/SWYH), die Idee ebenfalls.[line]Dieses Projekt ist unter der GNU GPLv2-Lizenz lizenziert - Details siehe Lizenz (https://github.com/0xeeeeeeeeeeee/AudioCopy/blob/master/LICENSE)[line][line][line][line][line][line][line][line]Debug-Informationen:[line]Datenverzeichnis: {1}[line][line]Einstellungen:[line]{2}[line][line]Letzter Log-Pfad:[line]{3}
es: AudioCopy {0} Copyright 0xeeeeeeeeeeee (0x12e) 2025.[line]En el futuro se basará en el componente AudioClone.[line]Parte del código del proyecto proviene de "Stream What Your Hear"(https://github.com/StreamWhatYouHear/SWYH), y la idea también proviene de él.[line]Este proyecto está licenciado bajo GNU GPLv2 - consulte la licencia para más detalles (https://github.com/0xeeeeeeeeeeee/AudioCopy/blob/master/LICENSE)[line][line][line][line][line][line][line][line]Información de depuración:[line]Directorio de datos: {1}[line][line]Configuración:[line]{2}[line][line]Última ruta de registro:[line]{3}
ko: AudioCopy {0} Copyright 0xeeeeeeeeeeee (0x12e) 2025.[line]향후 AudioClone 컴포넌트를 기반으로 구축될 예정입니다.[line]프로젝트의 일부 코드는 "Stream What Your Hear"(https://github.com/StreamWhatYouHear/SWYH)에서 가져왔으며, 아이디어 또한 여기서 차용했습니다.[line]이 프로젝트는 GNU GPLv2 라이선스로 배포됩니다 - 자세한 내용은 라이선스(https://github.com/0xeeeeeeeeeeee/AudioCopy/blob/master/LICENSE)를 참조하세요.[line][line][line][line][line][line][line][line]디버그 정보:[line]데이터 디렉토리: {1}[line][line]설정:[line]{2}[line][line]최근 로그 경로:[line]{3}
ru: AudioCopy {0} Авторские права 0xeeeeeeeeeeee (0x12e) 2025.[line]Часть кода проекта взята из "Stream What Your Hear" (https://github.com/StreamWhatYouHear/SWYH), идея также принадлежит этому проекту.[line]Проект лицензирован под GNU GPLv2 - подробности см. в лицензии (https://github.com/0xeeeeeeeeeeee/AudioCopy/blob/master/LICENSE)[line][line][line][line][line][line][line][line]Отладочная информация:[line]Каталог данных: {1}[line][line]Настройки:[line]{2}[line][line]Последний путь к логу:[line]{3}

# AboutPage_Privacy.Content
source: Privacy Policy
de: Datenschutzrichtlinie
es: Política de privacidad
ko: 개인정보 처리방침
ru: Политика конфиденциальности

# AdvancedSetting_Title.Text
source: Advanced Settings
de: Erweiterte Einstellungen
es: Configuración avanzada
ko: 고급 설정
ru: Расширенные настройки

# AdvancedSetting_Sure
source: Are you sure you want to do this?
de: Sind Sie sicher, dass Sie das tun möchten?
es: ¿Estás seguro de que quieres hacer esto?
ko: 이렇게 하시겠습니까?
ru: Вы уверены, что хотите это сделать?

# AdvancedSetting_showNonLocalAddress.Content
source: Show non-LAN addresses and virtual NICs in the 'Pairing' interface
de: Auf der "Kopplung"-Oberfläche werden nicht-lokale Netzwerkadressen und virtuelle Netzwerkkarten angezeigt
es: Mostrar direcciones no locales y adaptadores virtuales en la interfaz de "Emparejamiento"
ko: "페어링" 인터페이스에서 비-LAN 주소 및 가상 네트워크 어댑터 표시
ru: Отображение адресов вне локальной сети и виртуальных сетевых адаптеров в интерфейсе "Сопряжение"

# AdvancedSetting_forceMP3Audio.Content
source: Always allow MP3 streaming
de: Immer MP3-Streams wiedergeben erlauben
es: Reproducir siempre flujos MP3
ko: MP3 스트림 재생 항상 허용
ru: Всегда разрешать воспроизведение MP3-потоков

# AdvancedSetting_keepBackendRun.Content
source: Allow the backend to continue running after exit
de: Erlauben, dass das Backend nach dem Beenden weiterläuft
es: Permitir que el backend continúe ejecutándose después de salir
ko: 백엔드가 종료 후에도 계속 실행되도록 허용
ru: Разрешить фоновой работе продолжать работать после выхода

# AdvancedSetting_skipSplashScreen.Content
source: Skip initialisation screen
de: Startbildschirm überspringen
es: Omitir pantalla de inicialización
ko: 초기화 화면 건너뛰기
ru: Пропустить начальный экран

# AdvancedSetting_openDataFolder.Content
source: Open data folder
de: Datenordner öffnen
es: Abrir carpeta de datos
ko: 데이터 폴더 열기
ru: Открыть папку с данными

# AdvancedSetting_resetUUID.Content
source: Reset device identifier
de: Gerätekennung zurücksetzen
es: Restablecer ID de dispositivo
ko: 장치 ID 재설정
ru: Сбросить идентификатор устройства

# AdvancedSetting_resetTokens.Content
source: Clear all paired devices
de: Alle gekoppelten Geräte löschen
es: Borrar todos los dispositivos emparejados
ko: 모든 페어링된 기기 삭제
ru: Удалить все сопряженные устройства

# AdvancedSetting_resetBackend.Content
source: Full backend reset
de: Backend vollständig zurücksetzen
es: Reinicio completo del backend
ko: 백엔드 완전 초기화
ru: Полный сброс серверной части

# AdvancedSetting_resetAllSettings.Content
source: Reset all settings
de: Alle Einstellungen zurücksetzen
es: Restablecer toda la configuración
ko: 모든 설정 재설정
ru: Сбросить все настройки

# Setting_AudioQuality.Text
source: Sound Quality Settings
de: Soundqualitätseinstellungen
es: Configuración de calidad de sonido
ko: 음질 설정
ru: Качество звука

# Setting_Backend.Text
source: Backend settings
de: Backend-Einstellungen
es: Configuración del backend
ko: 백엔드 설정
ru: Настройки серверной части

# Setting_General.Text
source: General
de: Allgemein
ko: 일반
ru: Общий

# AdvancedSetting_Reset
source: Reset completed, please restart the application
de: Zurückgesetzt, bitte starten Sie die Anwendung neu
es: Reiniciado, por favor reinicie la aplicación
ko: 초기화되었습니다. 앱을 재시작해 주세요.
ru: Сброшено, перезапустите приложение

# AdvancedSetting_SureReset
source: All pairings will be invalidated, are you sure you want to do this?
de: Alle Kopplungen werden ungültig. Sind Sie sicher, dass Sie fortfahren möchten?
es: Todas las parejas dejarán de ser válidas, ¿estás seguro de que quieres hacer esto?
ko: 모든 페어링이 해제됩니다. 계속하시겠습니까?
ru: Все сопряжения станут недействительными. Вы уверены, что хотите продолжить?

# BackendSetting_Rebooted
source: Done. If issues persist, try updating or fully resetting the backend[line]In some cases, you may need to restart the application
de: Fertig. Falls Probleme bestehen, versuchen Sie bitte ein Update oder eine vollständige Zurücksetzung des Backends.[line]In einigen Fällen müssen Sie die Anwendung möglicherweise neu starten.
es: Hecho, si aún hay problemas, intenta actualizar o reiniciar completamente el backend[line]En algunos casos, puede que necesites reiniciar la aplicación
ko: 완료, 문제가 계속되면 백엔드를 업데이트하거나 완전히 재설정해 보세요[line]일부 경우에는 애플리케이션을 재시작해야 할 수 있습니다
ru: Готово. Если проблемы сохраняются, попробуйте обновить или полностью сбросить бэкенд[line]В некоторых случаях может потребоваться перезапуск приложения

# BackendSetting_RebootRequired
source: Restart the backend to apply changes
de: Backend neu starten, um Änderungen zu übernehmen
es: Reiniciar el backend para aplicar los cambios
ko: 변경 사항을 적용하려면 백엔드를 다시 시작하세요
ru: Перезапустите для применения изменений

# BackendSetting_Dangerous
source: These settings are very dangerous, are you sure you want to set them?
de: Diese Einstellungen sind sehr gefährlich, sind Sie sicher, dass Sie sie einstellen möchten?
es: Estas configuraciones son muy peligrosas, ¿estás seguro de que quieres configurarlas?
ko: 이 설정은 매우 위험합니다. 정말로 설정하시겠습니까?
ru: Эти настройки очень опасны, вы уверены, что хотите их установить?

# BackendSettings_OptionsProblem
source: There seems to be an issue with the options, please amend. ({0})
de: Bei den Optionen scheint ein Problem zu sein, bitte ändern. ({0})
es: Hay un problema con las opciones, por favor modifícalas. ({0})
ko: 옵션에 문제가 있는 것 같습니다. 수정해 주세요.({0})
ru: Возникла проблема с настройками, исправьте. ({0})

# GeneralSetting_Title.Text
source: General
de: Allgemein
ko: 일반
ru: Универсальный

# ReceiverOnly_ViewDownside
source: Please see below, click to reset
de: Bitte unten anzeigen, auf Zurücksetzen klicken
es: Por favor, mira abajo, haz clic en reiniciar
ko: 아래에서 확인하고 재설정을 클릭하세요
ru: Пожалуйста, посмотрите ниже и нажмите "Сбросить"

# ReceiverOnly_DownloadFullAudioCopy.Text
source: Download full version AudioCopy
de: Vollversion von AudioCopy herunterladen
es: Descargar versión completa de AudioCopy
ko: AudioCopy 전체 버전 다운로드
ru: Скачать полную версию AudioCopy

# ReceiverOnly_ThisIsReceiverOnly.Text
source: This application is the receiver. To adjust more settings, please go to the sender.
de: Diese Anwendung ist der Empfänger. Um weitere Einstellungen anzupassen, gehen Sie bitte zum Sender.
es: Esta aplicación es el receptor, para ajustar más configuraciones, vaya al emisor
ko: 이 앱은 수신 측입니다. 더 많은 설정을 조정하려면 발신 측으로 이동하세요
ru: Это приложение является приемником. Для настройки дополнительных параметров перейдите в передатчик.

# ReceiverOnly_LaunchLink
source: Open the link on your computer:
de: Link auf dem Computer öffnen:
es: Abrir enlace en la computadora:
ko: 컴퓨터에서 링크 열기：
ru: Откройте ссылку на компьютере:

# ReceiverOnly_OpenInBrowser
source: Open in browser
de: Im Browser öffnen
es: Abrir en el navegador
ko: 브라우저에서 열기
ru: Открыть в браузере

# AdvancedSetting_ApplyLocate
source: Applying localisation settings, please wait. Do not close this window or interact with the application.[line]The application will launch multiple times - this is expected behaviour
de: Lokalisierungseinstellungen werden angewendet, bitte warten Sie und schließen Sie dieses Fenster nicht oder interagieren Sie nicht mit der Anwendung.[line]Die Anwendung wird mehrmals gestartet, dies ist normal.
es: Aplicando configuraciones de localización, espere por favor. No cierre esta ventana ni interactúe con la aplicación.[line]La aplicación se iniciará varias veces, esto es normal.
ko: 로컬라이제이션 설정을 적용 중입니다. 잠시 기다려 주세요. 이 창을 닫거나 애플리케이션과 상호 작용하지 마십시오.[line]애플리케이션이 여러 번 시작될 수 있으며 이는 정상적인 현상입니다
ru: Применяются настройки локализации, пожалуйста, подождите, не закрывайте это окно и не взаимодействуйте с приложением.\r\n[line]\r\nПриложение может запускаться несколько раз, это нормально.

# ReceiverOnly_ViewLog.Content
source: View logs
de: Protokolle anzeigen
es: Ver registros
ko: 로그 보기
ru: Просмотр журнала

# ReceiverOnly_Lastest
source: Latest
de: Neueste
es: Último
ko: 최신
ru: последний

# AdvancedSetting_disableShowHostSMTCInfo.Content
source: Out of sync with peer media information
de: Keine Synchronisation der Medieninformationen von der Gegenstelle
es: No se sincroniza la información multimedia del extremo remoto
ko: 피어의 미디어 정보가 동기화되지 않음
ru: несинхронизированная медиаинформация от удаленной стороны

# AdvancedSetting_EnableSwagger.Content
source: Enable Swagger for new backend (Development only, do not use in production)
de: Swagger für neues Backend aktivieren (Nur für Entwicklung, nicht in Produktion verwenden)
es: Habilitar Swagger para el nuevo backend (solo para desarrollo, no usar en producción)
ko: 새로운 백엔드의 Swagger 활성화 (개발 전용, 프로덕션 환경에서 사용하지 마세요)

# BackendSetting_oldBackend.Content
source: Using the legacy backend
de: Altes Backend verwenden
es: Usar el backend antiguo
ko: 이전 백엔드 사용

# BackendSetting_ObsoleteSoon.Text
source: Since we've separated the backend into the application itself and AudioClone, these settings will be deprecated, and the following settings will no longer work with the new backend.
de: Da wir das Backend in die Anwendung selbst und in AudioClone aufgeteilt haben, werden diese Einstellungen bald veraltet sein, und die folgenden Einstellungen sind für das neue Backend ungültig.
es: Como hemos separado el backend entre la propia aplicación y AudioClone, estos ajustes quedarán obsoletos y los siguientes no tendrán efecto en el nuevo backend.
ko: 애플리케이션 자체와 AudioClone으로 백엔드를 분리했기 때문에, 이러한 설정은 곧 사용 중지될 예정이며 아래 설정은 새로운 백엔드에서 유효하지 않습니다.

# AudioQuality_NotAvailable.Text
source: Warning: These settings are currently ineffective for new backends and will always use the 'No resampling (use system-configured audio quality)' option.
de: Warnung: Diese Einstellungen sind derzeit für neue Backends ungültig und verwenden immer die Option "Keine Neuabtastung (Systemkonfigurierte Audioqualität verwenden)".
es: Advertencia: Esta configuración no es válida actualmente para el nuevo backend y siempre usará la opción "No remuestrear (usar la calidad de audio configurada en el sistema)".
ko: 경고: 이 설정은 현재 새로운 백엔드에 적용되지 않으며, 항상 "리샘플링 사용 안 함(시스템 구성 음질 사용)" 옵션이 적용됩니다.
